head()

tail()

shape

info()

describe()

dtypes

select_dtypes()

columns


rename()

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df2 = pd.DataFrame({'name':pd.Series(['riya','julie','marie','sandy','garim','darsh','ranisha','john']),'age':pd.Series([15,16,15,15,16,15,15,15]),'eng_marks':pd.Series([78,45,90,88,65,94,52,63]),'science_marks':pd.Series([87,54,100,78,55,44,92,73])})
df2

      name  age  eng_marks  science_marks
0     riya   15         78             87
1    julie   16         45             54
2    marie   15         90            100
3    sandy   15         88             78
4    garim   16         65             55
5    darsh   15         94             44
6  ranisha   15         52             92
7     john   15         63             73

In [ ]:
# head()
# displays first 5 rows

df2.head(2)

    name  age  eng_marks  science_marks
0   riya   15         78             87
1  julie   16         45             54

In [ ]:
# tail()
# displays last 5 rows of data
df2.tail(6)

      name  age  eng_marks  science_marks
2    marie   15         90            100
3    sandy   15         88             78
4    garim   16         65             55
5    darsh   15         94             44
6  ranisha   15         52             92
7     john   15         63             73

In [ ]:
# shape
# it displays the dimentionality(rows,columns)

df2.shape

(8, 4)

In [ ]:
# ndim
# displays the dimensions i.e return 1 for series, 2 for df
df2.ndim

2

In [ ]:
type(df2)

pandas.core.frame.DataFrame

In [ ]:
df3 = df2['name']
df3

0       riya
1      julie
2      marie
3      sandy
4      garim
5      darsh
6    ranisha
7       john
Name: name, dtype: object

In [ ]:
type(df3)

pandas.core.series.Series

In [ ]:
df3.ndim

1

In [ ]:
# size
# displays size of df(rows*columns)
df2.size

32

In [ ]:
# info()
# column wise dtype,null/non null entries
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           8 non-null      object
 1   age            8 non-null      int64
 2   eng_marks      8 non-null      int64
 3   science_marks  8 non-null      int64
dtypes: int64(3), object(1)
memory usage: 384.0+ bytes

In [ ]:
# describe()
# statistical summary column wise(mean,min max........)
df2.describe()

            age  eng_marks  science_marks
count   8.00000   8.000000       8.000000
mean   15.25000  71.875000      72.875000
std     0.46291  18.357073      20.131266
min    15.00000  45.000000      44.000000
25%    15.00000  60.250000      54.750000
50%    15.00000  71.500000      75.500000
75%    15.25000  88.500000      88.250000
max    16.00000  94.000000     100.000000

In [ ]:
# dtypes
# tells us about the data types that are present in a data frame
df2.dtypes

name             object
age               int64
eng_marks         int64
science_marks     int64
dtype: object

In [ ]:
# select_dtypes
# includes or excludes columns with particular dtypes
df2.select_dtypes(exclude=int,include=object)

      name
0     riya
1    julie
2    marie
3    sandy
4    garim
5    darsh
6  ranisha
7     john

In [ ]:
# columns
# we can see the names of all the columns that are present
df2.columns

Index(['name', 'age', 'eng_marks', 'science_marks'], dtype='object')

In [ ]:
# rename
# syntax::  df.rename(columns={},inplace=)
df2.rename(columns={'eng_marks':'english','science_marks':'science'},inplace=True)

In [ ]:
df2

      name  age  english  science
0     riya   15       78       87
1    julie   16       45       54
2    marie   15       90      100
3    sandy   15       88       78
4    garim   16       65       55
5    darsh   15       94       44
6  ranisha   15       52       92
7     john   15       63       73